[{"company_name": "Societe Generale", "description": "Responsibilities\n\nFor SG Group scope, he/she handles, as all alerts managers, the management of the alerts generated by FORCES platform (within the sanctions / embargos filtering framework, to contribute to SG Group financial safety.\n\nAs expert, he/she also participates in the analysis and operational translation of Group Compliance filtering instructions, in FORCES platform evolution projects and in a posteriori quality controls.\n\nMain responsibilities\n\nThe main tasks of the alerts expert Manager consist in:\n• Transactions filtering:\n• Analyzing the relevance of the alerts concerning real time or a posteriori filtered transactions\n• Contacting the Customer Manager for definitive decision (RBDF, IBFS Group departments) whenever necessary\n• Databases filtering:\n• Performing L1 analysis on alerts generated by the filtering of third parties’ databases against S/E lists\n• Contact L2 (Local Compliance) to obtain final decision on all suspicious alerts\n\nProfile required\n• Professional... experiences in Compliance activities: KYC (Know Your Customer), LAB / LFT (Fight against Money Laundering / Fight against Terrorism Financing)\n• Thoroughness and good risk sensitivity\n• Interest for open space teamwork and for newcomers' training\n• Reactivity, in particular capacity to analyze and to translate operationally as soon as possible any new alerts analysis instructions provided by the Compliance Group entity (CPLE/FCC/EMB)\n• Interest for processes optimization and for LEAN / BPM (Business Process Management) approaches.\nWhy join us\n\n“We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status”.\nBusiness insight\n\nAt Societe Generale, we are convinced that people are drivers of change, and that the world of tomorrow will be shaped by all their initiatives, from the smallest to the most ambitious.\n\nWhether you’re joining us for a period of months, years or your entire career, together we can have a positive impact on the future. Creating, daring, innovating and taking action are part of our DNA.\n\nIf you too want to be directly involved, grow in a stimulating and caring environment, feel useful on a daily basis and develop or strengthen your expertise, you will feel right at home with us!\n\nStill hesitating?\n\nYou should know that our employees can dedicate several days per year to solidarity actions during their working hours, including sponsoring people struggling with their orientation or professional integration, participating in the financial education of young apprentices, and sharing their skills with charities. There are many ways to get involved", "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "extensions": ["1 day ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC0gQ29tcGxpYW5jZSAtIENoZW5uYWksIEluZGlhIiwiaHRpZG9jaWQiOiI4T0k4TmxORnpEaDNXSEFnQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdmNCQ3JjQlFVMXNkbkp3YzFGcFMySXhXRzF3VkRGRE5UVnlaSE40TjFsa05rcHJRamhaVmpCc2NVcEZibWxOTWkxd2VVSmZTV2hMU1RoMFoySkxaMVV0U0hwbVowUm9iRGd5U25GMmNYcHZNRWs1U21aaE5HSTBkM05rUnpsS1MybE9jMjlFWlhwcU15MXhXVWQ1WmxGbldVWTJkMUJMWjJ4VlkxRmZPWGwxVXpKalJFRlZXSEZDWVRCS1JraFVSVXhPY0V4dmRUVkpVM0pJU0Roa1FsaDZNR05ZT1UxSVdHbEhkRXRFZHpKVlduTnRPVFpIVFVoM2RGaFJFaGM0V0ZobFdXRTNhRTlhVDBzNWRUaFFkVFZYY25OQldSb2lRVWhYVTA1dFYweHNVR3RYZEUxNVVGb3dPQzFvYW5ZNWQyZHhPQzFFY1ZSWVFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBTb2Npw6l0w6kgR8OpbsOpcmFsZSIsImxpbmsiOiJodHRwczovL2NhcmVlcnMuc29jaWV0ZWdlbmVyYWxlLmNvbS9lbi9qb2Itb2ZmZXJzL2FuYWx5c3QtMjIwMDAwU1AtZW4/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNo_X_VDd_a4AaBfSMOrx-CzOUsbbY4wReeiY1&s=0", "title": "Analyst - Compliance - Chennai, India", "via": "via Société Générale"}, {"company_name": "Barclays", "description": "Job Title: Analyst\n\nLocation: Chennai\n\nAbout Barclays\n\nBarclays is a British universal bank. We are diversified by business, by different types of customers and clients, and by geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations and functional services across the Group.\n\nRisk and Control Objective\n\nEnsure that all activities and duties are carried out in full compliance with regulatory requirements, Enterprise Wide Risk Management Framework and internal Barclays Policies and Policy Standards.\n\nWorking Flexibly\n\nWe’re committed to providing a supportive and inclusive culture and environment for you to work in. This environment recognises and supports ways to balance your personal needs, alongside the professional needs of our business. Providing the opportunity for all our employees... globally to work flexibly empowers each of us to work in a way that suits our lives as well as enabling us to better service our customers’ and clients’ needs. Whether you have family commitments or you’re a carer, or whether you need study time or wish to pursue personal interests, our approach to working flexibly is designed to help you balance your life.\n\nIf you would like some flexibility, then please discuss this with the hiring manager.\n• Produce daily desk PL including commentaries, investigate Flash/Formal differences\n• Ensure the maintenance of a strong internal control environment. Review key controls: FOBOs, adjustment substantiation and New, Amends & Cancels trades review\n\nWhat will you be doing?\n• Perform daily P&L, P&L attribution, P&L commentary, Investigate Flash vs. Formal differences\n• Develop a sound understanding of daily processes – “the what”, “the why” and “the how”.\n• Review P&L attributions and prepare commentaries and other MI\n• Maintain trader mandate, monitor Volcker limits.\n• Submit Clean & Hypo P&L for back-testing\n• Attend to ad hoc queries from the traders and other infrastructure partners relating to trading revenue and Balance Sheet.\n\nWeekly / Monthly Responsibilities\n• Balance Sheet control and commentary, Month End adjustments and Balance Sheet Substantiation\n• Perform key weekly & monthly reporting to senior management.\n• Attend to queries from internal and external audit and reviews and maintain key stroke documentations for key PC processes, risk assessment and SOX documentation.\n\nControls\n• Ensure that a strong internal control environment is maintained at all times. Review key controls: FOBOs, adjustment substantiation and New, Amends & Cancels trades review\n• Identify and drive process re-engineering and constantly challenge current processes for improvement and efficiency\n• Raise any control weaknesses to the team. Brainstorm with the team to come up with an action plan.\n\nPersonal Traits\n• Good financial product knowledge\n• Appreciation and understanding of financial markets\n• Experienced with MS office toolkit (Word, PPT, Excel, Access Database etc)\n• Be Self Motivated and Proactive to take initiative and improve the end product.\n• Work well within the team and portray high standards of team work.\n• Ask questions and challenge status quo. Do not assume that every current practice is the best practice. Question and satisfy yourself with the reasons for doing certain things in a certain way.\n• Excellent communication and inter-personal skills\n\nWhat We’re Looking For\n• Experienced with MS office toolkit (Word, PPT, Excel, Access Database etc)\n• Excellent communication and presentation skills in both formal and informal settings & ability to interact with the region and UK / US as part of a global team (written and verbal) Strong control awareness – in particular, the ability to identify and escalate potential control breakdowns and to streamline processes in an effective and efficient manner.\n• Has the initiative and ability to break down problems into components parts and resolving them\n• Attention to detail and analytical\n• Confident and assertive manner\n\nSkills That Will Help You In The Role\n• CFA / Masters in Finance / Financial Engineering would be an advantage\n• Articleship / Industrial trainee in mid to large sized firms\n• Audit exposure in large financial institutions / banks preferred\n\nWhere will you be working?\n\nChennai\n\nBe More at Barclays\n\nAt Barclays, each day is about being more – as a professional, and as a person. ‘Be More @ Barclays’ represents our core promise to all current and future employees. It’s the characteristic that we want to be associated with as an employer, and at the heart of every employee experience. We empower our colleagues to Be More Globally Connected, working on international projects that improve the way millions of customers handle their finances. Be More Inspired by working alongside the most talented people in the industry, and delivering imaginative new solutions that are redefining the future of finance. Be More Impactful by having the opportunity to work on cutting-edge projects, and Be More Valued for who you are.\n\nInterested and want to know more about Barclays? Visit home.barclays/who-we-are/ for more details.\n\nOur Values\n\nPurpose and Values\n\nWe deploy finance responsibly to support people and businesses, acting with empathy and integrity, championing innovation and sustainability, for the common good and the long term.\n\nOur values underpin everything we do: Respect, Integrity, Service, Excellence and Stewardship.\n\nRespect\n\nWe harness the power of diversity and inclusion in our business, trust those we work with, and value everyone's contribution.\n\nIntegrity\n\nWe operate with honesty, transparency and fairness in all we do.\n\nService\n\nWe act with empathy and humility, putting the people and businesses we serve at the centre of what we do.\n\nExcellence\n\nWe champion innovation, and use our energy, expertise and resources to make a positive difference.\n\nStewardship\n\nWe prize sustainability, and are passionate about leaving things better than we found them.\n\nOur Diversity\n\nWe aim to foster a culture where individuals of all backgrounds feel confident in bringing their whole selves to work, feel included and their talents are nurtured, empowering them to contribute fully to our vision and goals.\n\nOur Benefits\n\nOur customers are unique. The same goes for our colleagues. That's why at Barclays we offer a range of benefits, allowing every colleague to choose the best options for their personal circumstances. These include a competitive salary and pension, health care and all the tools, technology and support to help you become the very best you can be. We are proud of our flexible working options for colleagues. If you have a need for flexibility, then please discuss this with us.\n\n90306759", "detected_extensions": {"posted_at": "19 hours ago", "schedule_type": "Full–time"}, "extensions": ["19 hours ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IiwiaHRpZG9jaWQiOiJyYjlpZzBOdG1XOHB4VHZoQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFdUlCQ3FJQlFVMXNkbkp3ZGpKUFlrdEVha1JxVGs5T2VqTklNWFZXWm5CaE56RlNhR2hpTjFKelpFcFJRbmhTYlVKQlZXcEZlbmQxVDJscVFtdDVNbnBqZFMxNWFXaENTaTF2TFdObFUwZ3hWazVGUWpWUmJrdHpjVmhqWDBodGRXbGtkMDk1ZUhwUGVHZERXVEU0Y0ZGc1NIWklVR1oyYVhsSGFHRnJTM0prYjFwcmMxQjFjMG8yZVRoNU9EZEhkRmRXWlRsUVNIcHRkRk5FVm1OcVMxQlhVR0Z1VkZSbkVoYzRXRmhsV1dFM2FFOWFUMHM1ZFRoUWRUVlhjbk5CV1JvaVFVaFhVMDV0VlVkS1JWcGtaSFExVEU4MVEzbzNkMWxyWjFJMmFUQnBjbGhPWnciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIEluZGlhIiwibGluayI6Imh0dHBzOi8vaW4ubGlua2VkaW4uY29tL2pvYnMvdmlldy9hbmFseXN0LWF0LWJhcmNsYXlzLTI4NzIxOTcxNjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSL_kBfoJMXtNXSuE_Wi1D6hXejuZTE8s9P80o6inA&s", "title": "Analyst", "via": "via LinkedIn India"}, {"company_name": "CITI", "description": "ABOUT CITI\n\nCiti's mission is to serve as a trusted partner to our clients by responsibly providing financial services that enable growth and economic progress. We have 200 years of experience helping our clients meet the world's toughest challenges and embrace its greatest opportunities.\n\nANALYTICS AND INFORMATION MANAGEMENT (AIM)\n\nCiti AIM was established in 2003, and is located across multiple cities in India – Bengaluru, Chennai, Pune and Mumbai. It is a global community that objectively connects and analyzes information, to create actionable intelligence for our business leaders. It identifies fact-based opportunities for revenue growth in partnership with the businesses. The function balances customer needs, business strategy, and profit objectives using best in class and relevant analytic methodologies.\n\nWhat do we do?\n\nThe North America Consumer Bank data analytics team work on solving various business challenges using data as tool. The team extracts relevant insights... identifies business opportunities, and converts business problems into analytical framework implements solutions and designs go-to-market strategies for a huge variety of business problems.\n\nThe team supports the business in driving high revenues and better customer experience by focusing on following:\n• Customer lifecycle management: Design and implement strategies to improve customer experience and drive revenue, spanning across all 3 stages of customer lifecycle – acquisition, ECM and Retention\n• Offer optimization: Design, test and implement innovative and customer-centric offers tailored to drive customer delight and grow engagement\n• Digital: Trace customer’s digital journey with Citi, design strategies to make digital experience more engaging and drive revenue through digital channels\n• Revenue/Financial forecasting: Design, maintain and enhance P&L forecasting for all products & portfolios, ensure strict adherence to accounting standards and accurate forecasting techniques to help product managers plan better\n\nTeam analyzes millions of customer level transactions using various data analytics techniques to unlock opportunities for our clients in meeting their financial needs and creating economic value for the bank.\n\nWhat’s expected from you?\n\nAs a Business Analytics Analyst 2, we are seeking an experienced analytics candidate who should be able to perform below behaviors in their day to day role:\n• Client Obsession – Create client centric analytic solution to business problems. Individual should be able to have a holistic view of multiple businesses and develop analytics solutions accordingly.\n• Analytic Project Execution – Deliver multiple and complex analytic projects. This would require an understanding of business context, conversion of business problems in modeling, and implementing such solutions to create economic value.\n• Stakeholder Management: Exposure to handling multiple stakeholders across various functions and regions.\n• Presentation Skills : Delivering high class presentation to deliver the thoughts, the solutions or the problem for business stakeholders and senior management\n• Project Management – Should have skillset to manage project in terms of creating project plan, assigning responsibilities, and ensuring appropriate communication.\n• Ability to coach and mentor juniors\n• Contribute to organizational initiatives in wide ranging areas including competency development, training, organizational building activities etc.\n\nSkillsets you should possess\n\nThe most important skill that our analyst should possess is their love for data and their eagerness for new challenges & solving new problems. Apart from these, they should also have the following skillset\n\nBasic Qualifications\n• Bachelor’s Degree with 3 years of experience in data analytics, or Master’s Degree with 2 years of experience in data analytics\n• Hands-on experience in SAS and SQL, Excel VBA\n• Experience working with large and multiple datasets, data warehouses and ability to pull data using relevant programs and coding.\n• Experience in working on Credit Cards Products.\n\nPreferred Qualifications\n• Experience in SAS, SQL, R/R shiny programing\n• Experience on working in P&L Forecasting, Product Pricing, Acquisition Strategy projects\n\nOTHER DETAILS\n• Location: Chennai, India\n• Employment: Full Time\n• Industry: Credit Cards, Financial Services, Banking\n\n-------------------------------------------------\n\nJob Family Group:\nDecision Management\n\n-------------------------------------------------\n\nJob Family:\nSpecialized Analytics (Data Science/Computational Statistics)\n\n------------------------------------------------------\n\nTime Type:\nFull time\n\n------------------------------------------------------\n\nCiti is an equal opportunity and affirmative action employer.\n\nQualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCitigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi.\n\nView the \"EEO is the Law\" poster. View the EEO is the Law Supplement.\n\nView the EEO Policy Statement.\n\nView the Pay Transparency Posting", "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "extensions": ["1 day ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJTcGVjIEFuYWx5dGljcyBBbmFseXN0IDIiLCJodGlkb2NpZCI6InJ4bFhqRC16YTFjUTRvV1ZBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVUxc2RuSndjMkoxY25JNGNGRjZWVnBTYlhkSVJ6a3RWaTB5U0VWTGVIVkVMWFZhZUZnMVFsUm1NM3BQVTIxeGJVbG5hSGRqYVROc1dVUnphemh2YkVNNGF6ZE1VMlpPYkhjelNtNWFNSEJvYTBscWVteE5lV2czUjE5ME16Rk9XalJIYWtFeVdUVjVUbGxZWVZkWmFVNXBjbGh6WVVabU1WY3RVMWR0Tm1kbmRsRjViekJ1VWxCTlRtb1NGemhZV0dWWllUZG9UMXBQU3psMU9GQjFOVmR5YzBGWkdpSkJTRmRUVG0xV05rUTBaR3RUT1hOZlpDMVlUa1ZEZVZwWFYyeExkVUpKUkZGQiIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gSm9icyBBbmQgQ2FyZWVycyBBdCBDaXRpIiwibGluayI6Imh0dHBzOi8vam9icy5jaXRpLmNvbS9qb2IvY2hlbm5haS9zcGVjLWFuYWx5dGljcy1hbmFseXN0LTIvMjg3LzIxNjE1OTQ5MjMyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTQF3-cbQliaUv3I4ZZ1r_PLY3RBx89alsf2D5a&s=0", "title": "Spec Analytics Analyst 2", "via": "via Jobs And Careers At Citi"}, {"company_name": "Shell", "description": "Shell Trading integrates a global portfolio of crude oil, refined products, natural gas, electrical power and chemicals. Based in the UK, US, Canada, Singapore, The Netherlands, Japan, Barbados, Dubai, the Philippines and Russia and with over 2000 employees, on any one day we can trade over 14 million barrels of crude and oil products and 10 billion therms of gas and over 150 TWh of power.\n\nWe also provide marine expertise to over 40m operating units and manage a fleet of around 56 gas and oil tankers.\n\nWe are interested in attracting people to our business who share our core working values of honesty, integrity and have respect for others. We also want those who can build on our business vision, are prepared to accept accountability and can achieve great results through teamwork.\n\nPosition description & Purpose:\n\nYou will be working as a member of the Finance Operations team providing support to crude & products Freight trading. Invoices and payments are made for all STn (Shell... Trading Network) companies outside WONA (world outside North America) and North America (NA)\n\nThe role offers a challenging opportunity in a fast-moving dynamic and global trading environment.\n\nPrincipal Accountabilities\n\nEnsure Freight and related Shipping payments and invoices are processed accurately, on time and in accordance with agreed procedures and service standards. This will require validation of data in the business and finance systems.\n\nEnsure daily payment forecasts are delivered on time.\n\nEnsure that period end processes are carried out accurately and completed within deadlines.\n\nCoordinate payment proposal activities for the section, ensuring that payments are processed on a daily basis in accordance with settlement processing rules and procedures.\n\nEnsure daily tasks are performed in line with service standards and KPI’s.\n\nMaintain effective and appropriate systems and procedures, identifying opportunities for enhancements and ensuring ongoing SOX compliance.\n\nStrictly adhere to all relevant controls within this role.\n\nUndertake Ad hoc duties as required\n\nExperience and Qualifications Required:\n\nUniversity degree or equivalent qualification.\n\n2-3 years of Accounting knowledge and experience of back-office processes and procedures.\n\nProven ability to work pro-actively and without supervision\n\nPC literate, including Microsoft Outlook, Word & Excel.\n\nProven ability to work under pressure and to meet deadlines.\n\nGood awareness of underlying business, financial and fiscal issues with respect to energy/commodity trading and shipping.\n\nDemonstrate best practice behaviours.\n\nPossess a high level of interpersonal skills with the ability to communicate effectively across all cultures both within the organisation and with external customers\nProven ability to effectively challenge whilst remaining customer focused\n\nKey Competencies:\n\nAccuracy and attention to detail are key in this role\nAbility to work under pressure and to meet deadlines\nAbility to prioritise a heavy workload and work without supervision\n\nGood communication and interpersonal skills\nProactive approach to challenge and improve existing processes\n\nAptitude for learning new IT systems\nEffective team worker and problem solver", "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "extensions": ["1 day ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJBbmFseXN0IC0gVHJhZGluZyBcdTAwMjYgU2V0dGxlbWVudHMiLCJodGlkb2NpZCI6Inc3aEVpVExtcnNMQ1U0RW1BQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVzd0JDb3dCUVUxc2RuSndkRVZIUzFSd016YzVXR3BtUkdoUFVXTmFkRFJRUzA1R01WZHVhVGRhWTJOclJEUTJjVkpFZDI5d1oydFRjM0JZT0hJeVNtdDZVMkpQWm5BMFkwNVBTRkJVY0ZkWWVGaGFaRWxNYVRacU0xOXZUalJUVDJSd1dVY3lVWFYyU2w5R2RHRldXblZQUWtsV09IZDJWVlU1ZVdWUFlUWmZXbmhYWWtGRldscERNMlIxZFhWWGMyRVNGemhZV0dWWllUZG9UMXBQU3psMU9GQjFOVmR5YzBGWkdpSkJTRmRUVG0xV2NXSmlPVGxPVUZoVWNIWjVWR1o0Y2tkMFMybHNkVTFyTTFCMyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzQiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gU2hlbGwgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL2pvYnMuc2hlbGwuY29tL2pvYi9jaGVubmFpL2FuYWx5c3QtdHJhZGluZy1hbmQtc2V0dGxlbWVudHMvMjUyNDQvMjE2MTc2OTEwMDg/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ==", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSSLxcczmsvsGoDzOeeuwpKPravI-nxv4wY_urf&s=0", "title": "Analyst - Trading & Settlements", "via": "via Shell Careers"}, {"company_name": "Barclays", "description": "Job Title: KYC Senior Analyst\nLocation: Chennai\n\nAbout Barclays\nBarclays is a British universal bank. We are diversified by business, by different types of customers and clients, and by geography. Our businesses include consumer banking and payments operations around the world, as well as a top-tier, full service, global corporate and investment bank, all of which are supported by our service company which provides technology, operations and functional services across the Group.\n\nRisk and Control Objective\nEnsure that all activities and duties are carried out in full compliance with regulatory requirements, Enterprise Wide Risk Management Framework and internal Barclays Policies and Policy Standards.\n\nWorking Flexibly\n\nWe’re committed to providing a supportive and inclusive culture and environment for you to work in. This environment recognises and supports ways to balance your personal needs, alongside the professional needs of our business. Providing the opportunity for all our... employees, globally to work flexibly empowers each of us to work in a way that suits our lives as well as enabling us to better service our customers’ and clients’ needs. Whether you have family commitments or you’re a carer, or whether you need study time or wish to pursue personal interests, our approach to working flexibly is designed to help you balance your life.\nIf you would like some flexibility then please discuss this with the hiring manager.\n\nIntroduction:\n\n• A specialist member of the KYC (Know Your Customer) team responsible for obtaining, completing and maintaining all Regulatory KYC documentation for all clients in accordance with the Bank's guidelines and in compliance with UK & global financial regulations.\n• To provide high value, business critical KYC technical support to the Corporate Bank Relationship Team.\n• To liaise directly with Client Service Managers to gather KYC information, maintaining a professional manner and delivering excellent client service while managing potentially sensitive client information.\n• To work in partnership with other Barclays Corporate teams (UK Outreach Team, Relationship Directors and Financial Crime) – as well as our wider business functions (Barclays Wealth, and the Corporate Bank – both in the UK and internationally) – to deliver a ‘One Barclays’ client experience.\n\nWhat will you be doing?\n• Provide dedicated and robust specialist KYC expertise for the Standard KYC Refresh process in particular to our Client Service Manager teams.\n• Use a detailed and thorough understanding of the Corporate Bank’s KYC policy & requirements to collect and analyse KYC information that has been provided by Clients or sourced from the public domain.\n• Use expert KYC knowledge to analyse KYC information for a broad range of Corporate Clients, including a wide variety of specialist industry sectors and various unique/bespoke projects.\n• Take responsibility for maintaining a high standard of accurate, up-to date client information during all stages of the Client relationship, in order to protect the Bank and our Clients from financial crime.\n• Use strong problem solving and team working skills to resolve complex, high-priority cases, while ensuring the Bank’s regulatory requirements are always met.\n• Use strong communication skills to interact professionally with our Client Servicing Managers, UK Outreach team and internal stakeholders, supporting the Corporate Relationship Teams in delivering excellent Client service.\n• Use strong time management skills to complete complex, business critical tasks within pressured timescales – ensuring the KYC Team meets all target SLA’s, and providing a quick and efficient service to Clients.\n• Use a high level of attention to detail to complete tasks ‘right first time, every time’, ensuring the KYC Team’s ‘right first time’ targets are met for all tasks.\n\nWhat we’re looking for:\n• Excellent communication skills: must interact professionally with Client Servicing Managers and internal stakeholders via phone or email.\n• Excellent written and verbal English language skills required\n• In depth knowledge of Global KYC policies and procedures\n• End to End KYC Knowledge and Experience.\n\nSkills that will help you in the role:\n• Time management skills: must manage workloads effectively to complete complex and high-priority tasks within target timescales.\n• Analysis & Judgement: must undertake KYC analysis with a high level of accuracy and attention to detail.\n• Proven KYC Operational Background.\n• Experience of working with Financial Crime.\n\nWhere will you be working?\n\nChennai\n\nBe More at Barclays\nAt Barclays, each day is about being more – as a professional, and as a person. ‘Be More @ Barclays’ represents our core promise to all current and future employees. It’s the characteristic that we want to be associated with as an employer, and at the heart of every employee experience. We empower our colleagues to Be More Globally Connected, working on international projects that improve the way millions of customers handle their finances. Be More Inspired by working alongside the most talented people in the industry, and delivering imaginative new solutions that are redefining the future of finance. Be More Impactful by having the opportunity to work on cutting-edge projects, and Be More Valued for who you are.\nInterested and want to know more about Barclays? Visit home.barclays/who-we-are/ for more details.\nPurpose, Values and Mindset\n\nWe deploy finance responsibly to support people and businesses, acting with empathy and integrity, championing innovation and sustainability, for the common good and the long term.\nOur values underpin everything we do: Respect, Integrity, Service, Excellence and Stewardship.\n\nRespect\nWe harness the power of diversity and inclusion in our business, trust those we work with, and value everyone's contribution.\nIntegrity\nWe operate with honesty, transparency and fairness in all we do.\nService\nWe act with empathy and humility, putting the people and businesses we serve at the centre of what we do.\nExcellence\nWe champion innovation, and use our energy, expertise and resources to make a positive difference.\nStewardship\nWe prize sustainability, and are passionate about leaving things better than we found them.\n\nOur Mindset shapes how we take action, living by our Values, driven by our Purpose, always with our customers and clients at the heart of what we do; our Mindset is to Empower, Challenge and Drive.\n\nEmpower\nTrust and support each other to deliver. Make decisions with those closest to the topic. Include diverse perspectives. Celebrate success and learn from failure.\nChallenge\nQuestion whether things can be done better. Use insights based on data to inform decisions. Be curious about how we can adapt and improve. Speak up and be open to alternative viewpoints.\nDrive\nFocus on outcomes. Deliver with pace. Be passionate and ambitious about what we do. Take personal responsibility. Actively build collaborative relationships to get things done", "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "extensions": ["1 day ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJLWUMgU2VuaW9yIEFuYWx5c3QiLCJodGlkb2NpZCI6Ijgyb2czeGdYWmYwWXZIZjBBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVUxc2RuSndkRE5UVkZkc01IVmhNM0JPVkZGUGQzQlBWMDFLTlVsVVVIUnRNak5VVGxBd1luTlJlbFZvZEU1eGVVSkNkRGRPVVZwalJ6SjBUR2RWUlZSaGNGSnNNMVZQZEU1elYwRTFZWEUzWjFadlNsaG9Nbmx0WlVRd09EZFBVVVJ3ZUdGWlRXNUJhMnczWDBRemFtbDNZbWRNYm5oWlJqVTJaVFpKYWw5U2NEUldVMlpEVTE4MlZtbEhZa3BMTFcxQ2JFcHZkMmsyVDFsVWRGUnBTVTEzRWhjNFdGaGxXV0UzYUU5YVQwczVkVGhRZFRWWGNuTkJXUm9pUVVoWFUwNXRWMk50YkZsbU9WSjBjV2hMYnpGQ1QzUkVWWEJLZFdnMWN6bGxadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQmFyY2xheXMgQ2FyZWVycyIsImxpbmsiOiJodHRwczovL3NlYXJjaC5qb2JzLmJhcmNsYXlzL2pvYi9jaGVubmFpL2t5Yy1zZW5pb3ItYW5hbHlzdC8xMzAxNS8yMTU5ODg4NzEzNj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19", "location": "Chennai, Tamil Nadu, India", "title": "KYC Senior Analyst", "via": "via Barclays Careers"}, {"company_name": "FIS", "description": "Position Type\n\nFull time\n\nType Of Hire\n\nExperienced (relevant combo of work and education)\n\nEducation Desired\n\nBachelor of Computer Science\n\nBusiness Analyst\n\nAre you curious, motivated, and forward-thinking? At FIS you’ll have the opportunity to work on some of the most challenging and relevant issues in financial services and technology. Our talented people empower us, and we believe in being part of a team that is open, collaborative, entrepreneurial, passionate and above all fun.\n\nAbout The Team\n\nThis team is a involves in Design, code, test, implement, maintain and support applications software that is delivered on time and within budget. Work closely with customers, business analysts and team members to understand business requirements that drive analysis and design of quality technical solutions ensuring alignment with business and IT strategies and complying with FIS architectural standards.\n\nWhat You Will Be Doing\n• Provides application software development services typically... in a defined project.\n• Develops program logic for new applications or analyzes and modifies logic in existing applications.\n• Codes, tests, debugs, documents, implements and maintains software applications.\n• Makes recommendations towards the development of new code or reuse of existing code\n• Ensures system improvements are successfully implemented.\n\nWhat You Bring\n• Over 6 years of strong banking solutions or Banking experience - Retail / Commercial banking domain\n• Experience in requirements documentation and elicitation from varied geographical teams and banks\n• Product testing experience\n• Demonstrated exposure in conducting/participating in product demonstrations and assessment studies\n• Demonstrated understanding of solution architecture of banking applications and mapping it to a bank system landscape\n• Excellent communication skills - consistency and ease in discussions with leadership team of banks and in-house development teams\n• Should have worked in a bank in one of the retail or commercial banking domains\n• Must understand the nuances and dynamics of banking\n\nAdded Bonus If You Have\n• Knowledge of FIS’ products and services\n• Knowledge of financial services industry\n• Knowledge of basic financial analysis principles and ratios\n\nWhat We Offer You\n• An exciting opportunity be a part of World’s Leading FinTech Product MNC\n• To be a part of vibrant team and to build up a career on core banking/payments domain\n• Competitive salary and attractive benefits including GHMI/ Hospitalization coverage for employee and direct dependents\n• A multifaceted job with a high degree of responsibility and a broad spectrum of opportunities\n\nPrivacy Statement\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\n\nSourcing Model\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\n#pridepass", "detected_extensions": {"posted_at": "14 hours ago", "schedule_type": "Full–time"}, "extensions": ["14 hours ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJCdXNpbmVzcyBTeXN0ZW1zIEFuYWx5c3QgU2VuaW9yIiwiaHRpZG9jaWQiOiJpY21WU1huNTIzTlRxVV9jQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVMXNkbkp3ZFdSek1uWkxTWGw1ZUdGMFUzVktSVEZCY1V0ZldYQTNSM2R0YVZGUlUzQndVVkE1VVd3d0xUWnBaMWRITVVKamRWWnZTa1UyYW1KTlUxSmFkMGwyZVc5RlVrOTNhM2RSVFVrM1NUaEhiRm95VTJKeGVUUlpUSGRzWldaRFlqZGFXWFJrVlZGUFdrWjZZbWhyTFd0cVdIWlZUazU1Um1aelJEa3dlR1ZxVDFkVlZUSk9PV1FTRnpoWVdHVlpZVGRvVDFwUFN6bDFPRkIxTlZkeWMwRlpHaUpCU0ZkVFRtMVZObnA1TFhvNWVURTFWamhaUm5ka1MwVlJkV3RvU2xSVWVqTlIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY182IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExpbmtlZEluIEluZGlhIiwibGluayI6Imh0dHBzOi8vaW4ubGlua2VkaW4uY29tL2pvYnMvdmlldy9idXNpbmVzcy1zeXN0ZW1zLWFuYWx5c3Qtc2VuaW9yLWF0LWZpcy0yODcwNzE2MzYzP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTrYNgXFWHHYppII4ZdIwX1XaBvoU6Mgur41QLqjVk&s", "title": "Business Systems Analyst Senior", "via": "via LinkedIn India"}, {"company_name": "50200132 - Associate Application Engineer – Level 2", "description": "JOB TITLE : CONSULTANT\n\nCAREER LEVEL: C2\n\nLeverage technology to impact patients and ultimately save lives\n\nDo you have expertise in, and passion for, information technology? Would you like to apply your expertise to impact the IT strategy in a company that follows the science and turns ideas into life changing medicines? If so, AstraZeneca might be the one for you!\n\nABOUT ASTRAZENECA\n\nAstraZeneca is a global, science-led, patient-focused biopharmaceutical company that focuses on the discovery, development and commercialisation of prescription medicines for some of the world’s most serious disease. But we’re more than one of the world’s leading pharmaceutical companies. At AstraZeneca we’re dedicated to being a Great Place to Work.\n\nABOUT OUR IT TEAM\n\nIt’s a dynamic and results-oriented environment to work in – but that’s why we like it. There are countless opportunities to learn and grow, whether that’s exploring new technologies in hackathons, or redefining the roles and work of... colleagues, forever. Shape your own path, with support all the way. Diverse minds that work cross- functionally and broadly together.\n\nABOUT THE ROLE\n\nThe Learning Analyst will collaborate with key business stakeholders and Learning Admin colleagues to build and sustain a culture of learning in the organisation. This role is critical to global learning team's ongoing growth, having responsibility for designing, developing, deploying, and measuring comprehensive solutions, action plans, and training to improve individual and team performance.\n\nYou will be part of our Learning IT Support team, the aim of which is to provide seamless IT support to AstraZeneca’s Learning platform.\n\nYou are highly motivated, seeking to expand your career and contribute to building a global learning function. You thrive in a collaborative team environment and can balance multiple priorities simultaneously.\n\nYour ability to drive change: to transform, align and inspire in a fast-paced environment. You are Process-oriented, with a tireless focus on quality of deliverables, intellectual curiosity and problem-solving acumen to transform abstract ideas into tangible solutions, capability and interest to research and learn new subject matter and outstanding initiative with solid customer service and interpersonal skills are key for success in this role.\n\nTools: You have strong working knowledge on varied learning tools and technologies such as Learning Management Systems, Learning Experience Platforms, Learning Content Management Systems, Adaptive Learning Tools and leading reporting and analytics tools. The role holder is responsible for building integrations between the learning systems and to build tools for automating repeatable manual tasks.\n\nAnalytics and Reporting: Knowledge of tools, techniques and metrics that enable reporting returns from learning in easily digestible format, and measure learning outcomes compared to business object\n\nDecision Making and Critical Thinking: Knowledge of tools and techniques for effective use of a broad range of methods, assumptions, frameworks, and perspectives when solving problems\n\nLearning Evaluation: Knowledge of methods, tools, and techniques for evaluating the effectiveness and impact of learning systems\n\nRequired qualitifications and skills:\n• Strong Knowledge in Java, REST API and API development\n• Working knowledge in Degreed, Xyleme administration, integration and release activities\n• Knowledge of Saba Cloud L3 and related web-based training standards such as SCORM, AICC etc.\n• Ability to perform troubleshooting eLearning content (all formats), bulk uploads, build integrations, Perform impact analysis based on release notes, document and resolve incidents and problem tickets.\n• Excellent analytical and questioning skills to support effective and creative problem solving.\n• Knowledge on ITIL Framework, understanding of incident, problem, change and release management process.\n• Ability to liaise with multiple stake holders including users, infrastructure/middleware teams, 3rd party software vendors for resolving issues and potential process improvements.\n\nDesired qualitifications and skills:\n• Exposure to adaptive learning technologies is desirable\n• Knowledge in MuleSoft, RDBMS, and MicroStrategy is desirable\n• Excellent written and oral communication skills\n• Knowledge in IT Service management and Experience working on ITSM tools like Service Now\n• Ability to work effectively independently and as part of a team to achieve objectives\n• Eager to learn and develop new tech skills as required\n• Demonstrable Customer focus and ability to work under pressure\n• A self-starter with high levels of drive, energy and resilience\n• Desired Academic Qualification: BE/B.Tech in Computer Science/IT or equivalent\n\nOVERALL YEARS OF EXPERIENCE 8 to 12 years (Senior Consultant)\n\nWHY JOIN US ?\n\nWe’re a network of high-reaching self-starters who contribute to something far bigger. We enable AstraZeneca to perform at its peak by delivering premier technology and data solutions.\n\nWe’re not afraid to take ownership and run with it. Empowered with unrivalled freedom. Put simply, it’s because we make a significant impact. Everything we do matters.\n\nSO, WHAT’S NEXT?\n\nAre you already envisioning yourself joining our team? Good, because we’d love to hear from you! Click the link to apply and we’ll be in touch as soon as we can.\n\nWHERE CAN I FIND OUT MORE?\n\nOur Social Media, Follow AstraZeneca on LinkedIn https://www.linkedin.com/company/1603/\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status", "detected_extensions": {"posted_at": "1 day ago", "schedule_type": "Full–time"}, "extensions": ["1 day ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJDb25zdWx0YW50IC0gTDIgU3VwcG9ydCBBbmFseXN0IiwiaHRpZG9jaWQiOiJlY2RCbkY3MmpzRTVJNFk0QUFBQUFBPT0iLCJobCI6ImVuIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEFzdHJhWmVuZWNhIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmFzdHJhemVuZWNhLmNvbS9qb2IvY2hlbm5haS9jb25zdWx0YW50LWwyLXN1cHBvcnQtYW5hbHlzdC83Njg0LzIxNjAwODc2Mzg0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=", "location": "Chennai, Tamil Nadu, India", "title": "Consultant - L2 Support Analyst", "via": "via AstraZeneca Careers"}, {"company_name": "Philips", "description": "Philips Global Business Services LLP is a limited liability partnership organization with Royal Philips of the Netherlands. Royal Philips is a diversified technology company, focused on improving people's lives through meaningful innovation in the areas of Health Systems and Personal Health.\n\nPhilips Global Business Services, Chennai is an organization that centralizes and standardizes rule-based processes as well as process, analytical and data-driven activities from enabling and business functions with an End2End approach, to accelerate best service delivery for our customers and support the Health Technology business. Our strong Functional leader with Global Partnering Mindset creates superior Customer Value Creations that enables business to thrive in market place. Philips GBS Chennai is leading Global RPA Programs for Businesses & Functions along with Advance Analytics for Deep Business Insights & enabling Quality Planning & Decision-Making. We are driven by our strong culture of... Lean & Continuous Improvement for high quality & Productivity. GBS is Philips’ in-house competence center driving excellence in our business operations.\n\nAnalyzes and reports on business performance by means of: Monthly performance, AOP, product/market/customer/integral profitability, Quarterly Forecasting, RoFo, Strategic Review, cost control, Target Setting / Remuneration, Pricing/margin analysis, etc. Performs forward-looking ad-hoc analysis, such as project & strategy evaluation, benchmarking, Price/Volume mix, scenario analysis, etc. Prepares, attends, minutes, and keeps track of follow-ups regarding performance and strategy meetings. Takes initiative to bring relevant financial issues to the attention of his/her relevant stakeholders. Participates in various x-BG/Sector/Market Finance improvement projects. Understands systems and tools. Ensures quality, accuracy, and integrity of information stored in our systems, enabling a single source of truth", "detected_extensions": {"posted_at": "17 hours ago", "schedule_type": "Full–time"}, "extensions": ["17 hours ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJGUFx1MDAyNkEgQW5hbHlzdCIsImh0aWRvY2lkIjoiaWthVG56bm94bXhjNnhlaEFBQUFBQT09IiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVTFzZG5Kd2RtUnpNR2xMZG5GbmNpMXVlbGxIV1dReVJEUXlVSGRWZUVoUlRFTmlhVWhoVFVnNVZsTm5ia0ZqZGxOYU4zWkVUSGsxWlVSV2RqUlJWbUZJTkdaRFFqQlFXVVF4ZW1WWk1YRjJaazE1VDFGTFpWaFdRV0ZvYnpWMWVYcElhM2RUY21VdGFuaEZlbWR2YzAxNlNFZElURnBoVjFwSVFVRkxlRWhOVGxCQ1NucDJWV3BNWVdNU0Z6aFlXR1ZaWVRkb1QxcFBTemwxT0ZCMU5WZHljMEZaR2lKQlNGZFRUbTFXV0VSVVZVbFlkMnRWV21OWVNrVXdXRXBtV1d4SVprZ3lhV2RSIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNyIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBMaW5rZWRJbiBJbmRpYSIsImxpbmsiOiJodHRwczovL2luLmxpbmtlZGluLmNvbS9qb2JzL3ZpZXcvZnAtYS1hbmFseXN0LWF0LXBoaWxpcHMtMjg3MjU0NTU4MT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSt19eSdl3jGC88Clwh8qsbHxCoOOsmzuPeg5o_cFE&s", "title": "FP&A Analyst", "via": "via LinkedIn India"}, {"company_name": "Shell", "description": "General Position Definition\n• This role will drive reporting analytics and data analysis for one or more of Shell’s Retail business teams\n• The ideal candidate is passionate about delivering commercial value and insights through Retail Analytics and Business Intelligence.\n• Ideal candidate will work on:\n• Engaging the stakeholders to understand the business problem and gather requirements\n• Data extraction and reporting using different tools and techniques like Alteryx, SQL, R/Python etc\n• Generate insights from the data and effective story boarding.\n• Ability to identify and suggest key performance indicators for the stakeholders.\n• Responsible for maintaining the reporting requirements\n• Regularly interact with stakeholders/business owners and present actionable insights from the dashboards.\n• Candidate should be able to ask the right questions, ability to move from data to insight to action, break down strategic & operational questions from different Retail teams and structurally... answer them with data driven insights\n• Should have intensive experience in Business Intelligence – creating dashboards, providing business performance insights and storyboarding the outcome.\n• Incumbent is responsible for working on a range of technologies and tools collaborating directly with the Retail stakeholders & other partners\n\nSkills\n\nIndustry / Functional Expertise\n• Provide deep business expertise in Retail/CPG businesses:\n• Category Analytics: Range reviews, Assortment planning, identifying trends and patterns in category performance, new product launches\n• Pricing Analytics: Understanding Price elasticity, evaluating impact of competitor pricing, impact of pricing changes on margins\n• Marketing and Promotion Analytics: Campaign design and promo effectiveness testing, churn prediction, cross-sell / up-sell, Market Basket Analysis, Customer segmentation, propensity analysis, customer lifetime value, market mix modeling\n• Store Analytics: Leverage data and visualization to create actionable insights for on ground store teams, territory and district managers\n• Should have strong story telling skills: Ability to explain complex data and models to business teams\n• Proficiency Level: Intermediate\n\nStakeholder Engagement Skills\n• Working collaboratively across multiple sets of stakeholders – business SMEs, IT, Data teams, Analytics resources to deliver on project deliverables and tasks\n• Identify actionable insights that directly address Retail Team’s challenges / opportunities\n• Articulate business insights and recommendations to respective stakeholders\n• Understanding business KPI's, frameworks and drivers for performance\n• Proficiency Level: Mastery\n\nTechnology Skills\n• Strong experience in specialized analytics tools and technologies (including, but not limited to)\n• Azure Databricks/Alteryx/SQL\n• Power BI, Spotfire or other visualization tools\n• Python/ R\n• Reporting skills: Data collection, Data cleaning, Data Quality Analysis, Exploratory data analysis, Reporting Automation, Uni variate analysis, Bi-variate analysis, Data visualization, Dashboard maintenance and leverage various reporting tools\n• Should be strong at understanding data architecture or frameworks.\n• Assess data availability and reporting/modelling feasibility\n• Proficiency Level: Skill-to-Mastery\n\nSpecial Challenges\n• Easily analyzes, draw and synthesizes important insights from complex data.\n• Identify relevant data sources available and pro-actively suggest on integration of various data sources to drive business requirements.\n• Extremely curious and self-driven to understand business performance through data.\n• Ability to translate a business question into a well-defined analytical plan that includes data requirements for technical resources to extract the necessary data.\n• Rapid onboarding on projects, understanding analytics goal and working with ill-defined datasets\n• Communicating technical jargon in plain English to colleagues within Data Science team and outside\n• Virtual working with network of colleagues located throughout the globe\n\nExperience\n• Minimum 2- years of relevant experience in Retail Analytics\n• Should have strong experience in delivering dashboards with at least one of the technologies POWERBI/SPOTFIRE/QLIK\n• Preferred experience in Retail, CPG or E-commerce\n• Good interpersonal communication skills and influencing skills\n• Eagerness to learn and ability to work with limited supervision", "detected_extensions": {"posted_at": "2 days ago", "schedule_type": "Full–time"}, "extensions": ["2 days ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJCSSBBbmFseXN0IiwiaHRpZG9jaWQiOiIxYjM4Tk9jR0hnTmZqODhqQUFBQUFBPT0iLCJobCI6ImVuIiwiZmMiOiJFc3dCQ293QlFVMXNkbkp3ZEZWWVVETk1Ta3B3YWpKNWRsRnRUVVZTTVRGTU0yNW9aMXB5UjFkTVZXZGtYMHh4T1daSk1sWkRjVGhwVGtGUWNFWkVjMGxhYUhWcVFUSjVaMTlYVFZCUFdYQnhiRTAwYmpoaWRsOWZUVmxmWVhNMGFYSkpWbGM1VWpKR05ubDVXWFkzZDNCdlZtUjVURFZPUzFKU1drYzRiVkZ2WWt4eU9TMWhSMUJaUVV4bmJFWnJOamtTRnpoWVdHVlpZVGRvVDFwUFN6bDFPRkIxTlZkeWMwRlpHaUpCU0ZkVFRtMVlZMU52TTFObk1ITXpXSFJGTjFoaGNVdEpVelphUVhsNE5rVkIiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY184IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFLDqXN1bHRhdHMgRGUgUmVjaGVyY2hlIC0gU2hlbGwgQ2FuYWRhIiwibGluayI6Imh0dHBzOi8vZW1wbG9pcy5zaGVsbC5jYS9lbXBsb2kvY2hlbm5haS9iaS1hbmFseXN0LzM0MzM3LzIxNTUwOTQ2MjI0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0=", "location": "Chennai, Tamil Nadu, India", "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSSLxcczmsvsGoDzOeeuwpKPravI-nxv4wY_urf&s=0", "title": "BI Analyst", "via": "via Résultats De Recherche - Shell Canada"}, {"company_name": "BNP Paribas Wealth Management", "description": "Job Description - APAC\n\nAbout BNP Paribas Group:\n\nBNP Paribas is a top-ranking bank in Europe with an international profile. It operates in 71 countries and has almost 199 000 employees. The Group ranks highly in its three core areas of activity: Domestic Markets and International Financial Services (whose retail banking networks and financial services are grouped together under Retail Banking & Services) and Corporate & Institutional Banking, centred on corporate and institutional clients. The Group helps all of its clients (retail, associations, businesses, SMEs, large corporates and institutional) to implement their projects by providing them with services in financing, investment, savings and protection. In its Corporate & Institutional Banking and International Financial Services activities, BNP Paribas enjoys leading positions in Europe, a strong presence in the Americas and has a solid and fast-growing network in the Asia/Pacific region.\n\nAbout BNP Paribas India... Solutions:\n\nEstablished in 2005, BNP Paribas India Solutions is a wholly owned subsidiary of BNP Paribas SA, a leading bank in Europe with an international reach. With delivery centers located in Bengaluru, Chennai and Mumbai, we are a 24x7 global delivery center. India Solutions services three business lines: Corporate and Institutional Banking, Investment Solutions and Retail Banking for BNP Paribas across the Group. Driving innovation and growth, we are harnessing the potential of over 6000 employees, to provide support and develop best-in-class solutions.\n\nAbout Business line/Function :\n\nFor 150 years, BNP Paribas Wealth Management has been committed to protecting clients’ wealth, developing it, and eventually passing it on to their loved ones. We deliver tailor-made experience, with outstanding attention to detail and expertise from precise local knowledge to the global know-how that we access from the Group. Our goal is to create a new wealth management experience fit for a world where digital interactions have come to enhance human ones. Wealth Management Investment Solution Hub (WMIS Hub) provides a global IT solution for BNP Paribas Wealth Management where we develop, maintain and evolve IT applications which fits to the specific needs of BNP Paribas Wealth Management business users.\n\nJob Title:\n\nSenior Application Support Analyst\n\nDate:\n\n16-March-2021\n\nDepartment:\n\nIT\n\nLocation:\n\nChennai\n\nBusiness Line / Function:\n\nWealth Management\n\nReports to:\n\n(Direct)\n\nNA\n\nGrade:\n\n(if applicable)\n\n(Functional)\n\nNumber of Direct Reports:\n\nNA\n\nDirectorship / Registration:\nPosition Purpose\n\nPart of BNPP Wealth Management in Chennai, the position is created to handle Application Support activities. Candidate will play a major role in handling Incidents, BAU service requests and Application Support activities in shifts\n\nResponsibilities\n\nAs a team member of APS:\n• Provide L1/L2 Application support to Front Office and Credit Risk users\n• Adhere to Service Level objective target and roadmap shared by Head of APS\n• Ensure adherence to APS support roster in terms of mailbox, webportal and hotline\n• Ensure batch related issues are attended and resolved on time\n• Escalate timely to Head of APS on possible risks, escalation matters and management issues.\n• Prioritize and deliver outstanding service, troubleshooting and resolving issues from Business teams\n• Review and create application Support knowledge articles.\n• Ensure that the all production deliverables are aligned with bank standards and best practices.\n• Analyze system logs and identifying potential issues with Application.\n• Service monitoring, reporting and continuous improvement of the service quality and availability.\n• Implement communication charter to provide updates on production health status on a proactive manner.\n• Should take part in 24/7 production support (i.e Shifts/Weekend/Public holidays)\nTechnical & Behavioral Competencies\n\nQualification & Experience:\n• Total 5+ years of overall IT experience.\n• Total 2+ years of experience supporting Front Office/Credit Risk Applications\n\nEssential Technical Knowledge/Skills :\n\nTechnical skills\n\nProficiency Level\n\nITIL practices\n\nStrong\n\nUnix OS\n\nIntermediate\n\nDatabase(SQL/Oracle/PLSQL)\n\nIntermediate\n\nAutosys or Any scheduling system\n\nBasic\n\nJava Language\n\nBasic\n\nKafka / MQ / Tomcat\n\nBasic\n\nJira and Service Now\n\nBasic (optional)\n\nMandatory\n• Strong critical thinker with problem solving approach.\n• Quality Assurance process (i.e. Go Live planning, assist UAT)\n• Good written and oral communication skills.\n• Intermediate functional knowledge in Banking\nSpecific Qualifications (if required)\n\nSkills Referential\n\nBehavioural Skills: (Please select up to 4 skills)\n\nCritical thinking\n\nCommunication skills - oral & written\n\nAbility to share / pass on knowledge\n\nPersonal Impact / Ability to influence\n\nTransversal Skills: (Please select up to 5 skills)\n\nAnalytical Ability\n\nChoose an item.\n\nAbility to develop and adapt a process\n\nAbility to understand, explain and support change\n\nChoose an item.\n\nEducation Level:\n\nBachelor Degree or equivalent\n\nExperience Level\n\nAt least 5 years\n\nOther/Specific Qualifications (if required)\n\nNA", "detected_extensions": {"posted_at": "3 days ago", "schedule_type": "Full–time"}, "extensions": ["3 days ago", "Full–time"], "job_id": "eyJqb2JfdGl0bGUiOiJTdXBwb3J0IEFuYWx5c3QiLCJodGlkb2NpZCI6Inh4TVpvSER6Q19EMzNFQVhBQUFBQUE9PSIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVUxc2RuSndkWEExVW1Fd1VURmtiME16T0U0eGFtUlJlblZTVTBKM1luTmlZMVEzWWtSdE4yNHlSWEEzWHpJME9URkROWHAxVGs1cFlsZHZhRVZ0U0dsSVgydzBaRVp1VTNWdE4yNXJaMm8wV1ZaSk5WbHZWbGMzVlVSMmJIRXhOVWhzUmxFMVNVZzJUV3RPVDBWd1VqVktSVGxyVjNGUE5qaHVlak5RYldOVFQyOU5lVGh2ZUZGelIwcFNSMEp5T0ROSE5HaGZXbWRrVmpOdFV6RnlkbWQxT1RCcFdISXhibGRzWVVJMlNFUktkRlpRUkhCRFJpMVliRGRXVGpaUlRXZDNlRnB1YlVGVkxWUmtFaGM0V0ZobFdXRTNhRTlhVDBzNWRUaFFkVFZYY25OQldSb2lRVWhYVTA1dFZVZFNWbVZZYmtaemFUUk9jVk16TXpseGJscDBhMGhOU1c1bVVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBHcm91cGUgQk5QIFBhcmliYXMiLCJsaW5rIjoiaHR0cHM6Ly9ncm91cC5ibnBwYXJpYmFzL2VuL2NhcmVlcnMvam9iLW9mZmVyL3N1cHBvcnQtYW5hbHlzdC03Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19", "location": "Chennai, Tamil Nadu, India", "title": "Support Analyst", "via": "via Groupe BNP Paribas"}]